[
    {
  "institution": "William Velie Attorneys at Law",
  "position": "BUSINESS DATA ANALYST",
  "location": "Norman, OK, USA",
  "startDate": "June 2025",
  "endDate": "Present",
  "description": [
    "Built a passport-reading workflow using OCR + neural networks (Python, OpenCV, Tesseract, PyTorch), cutting data-entry time by ~70×.",
    "Developed a pipeline that parses bank payment confirmations and auto-generates incoming fees matched to matters, reducing the Finance handoff by ~50%.",
    "Proposed and delivered tech solutions tailored to the firm’s needs, turning operational pain points into scoped automations with clear ROI."
  ]
},

    {
        "institution": "Netsys Research Lab @ The University of Oklahoma",
        "position": "GRADUATE RESEARCH ASSISTANT",
        "location": "Norman, OK, USA",
        "startDate": "January 2024",
        "endDate": "August 2025",
        "description": [
            "Developed an optimization model for graph design based on multi-scenario analysis, each with varying demands, ensuring the graph adapts to fluctuations and provides a resilient solution.",
            "Focused on creating a network that efficiently accommodates demand variability, enhancing resilience and reliability in complex systems."
        ]
    },
    {
        "institution": "Latin American Reserve Fund",
        "position": "FINANCIAL ANALYST INTERN",
        "location": "Bogotá, Colombia",
        "startDate": "January 2023",
        "endDate": "July 2023",
        "description": [
            "Developed and implemented predictive financial models in Python, including a dollar inflation model with an accuracy rate of 99.8%, driving data-driven decision-making and reducing forecasting errors in public and private investments.",
            "Diagnosed and resolved critical issues in the data processing pipeline, leading a team initiative to refine methodologies, which improved overall data accuracy and operational efficiency.",
            "Designed and delivered comprehensive educational materials to effectively communicate complex mathematical models used in economic analysis, enhancing cross-functional understanding and application."
        ]
    }

]

